Tekla Open API Reference for Tekla Structures 2025
Building Methods
The LogicalAreaFilterExpressions.Building type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
LogicalAreaFilterExpressions.Building Class
Tekla.Structures.Filtering.Categories Namespace